docs/loadtest/raw/20260227-stage-a/ab_get_messages.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            6688

Document Path:          /api/chats/12/messages?limit=20
Document Length:        2 bytes

Concurrency Level:      50
Time taken for tests:   0.803 seconds
Complete requests:      3000
Failed requests:        0
Keep-Alive requests:    3000
Total transferred:      953945 bytes
HTML transferred:       6000 bytes
Requests per second:    3737.33 [#/sec] (mean)
Time per request:       13.379 [ms] (mean)
Time per request:       0.268 [ms] (mean, across all concurrent requests)
Transfer rate:          1160.55 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       2
Processing:     5   13   2.4     13      30
Waiting:        4   13   2.4     13      30
Total:          6   13   2.4     13      30

Percentage of the requests served within a certain time (ms)
  50%     13
  66%     13
  75%     14
  80%     14
  90%     15
  95%     16
  98%     20
  99%     28
 100%     30 (longest request)