docs/loadtest/raw/20260227-stage-a/ab_post_messages.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            6688

Document Path:          /api/chats/12
Document Length:        Variable

Concurrency Level:      20
Time taken for tests:   0.525 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      493130 bytes
Total body sent:        700000
HTML transferred:       147997 bytes
Requests per second:    1905.41 [#/sec] (mean)
Time per request:       10.496 [ms] (mean)
Time per request:       0.525 [ms] (mean, across all concurrent requests)
Transfer rate:          917.59 [Kbytes/sec] received
                        1302.53 kb/s sent
                        2220.12 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     6   10   4.0      9      47
Waiting:        6   10   4.0      9      46
Total:          6   10   4.1      9      48

Percentage of the requests served within a certain time (ms)
  50%      9
  66%      9
  75%      9
  80%     10
  90%     11
  95%     18
  98%     26
  99%     29
 100%     48 (longest request)